Revit 2024 API
AccessDeniedException Class
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[SerializableAttribute]
public class AccessDeniedException : ApplicationException
Visual Basic
<SerializableAttribute> _
Public Class AccessDeniedException _
	Inherits ApplicationException
Visual C++
[SerializableAttribute]
public ref class AccessDeniedException : public ApplicationException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.AccessDeniedException
See Also
AccessDeniedException Members
Autodesk.Revit.Exceptions Namespace